---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet
source: html/1dd8a73e-d39d-602c-d725-0646b0a1052d.htm
---
# TemperatureRatingTypeSet Members

Initializes a new instance of the TemperatureRatingTypeSet class